Revit 2024 API
WrongUserException Class
The exception thrown when a local model is manipulated under a different username than it was created with.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[SerializableAttribute]
public class WrongUserException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class WrongUserException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class WrongUserException : public InvalidOperationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.WrongUserException
See Also
WrongUserException Members
Autodesk.Revit.Exceptions Namespace